using System;

namespace Problem2
{
    class Program
    {
        static void Main()
        {
            // Превърнете числото 1111010110011110(2) в шестнадесетична и в десетична бройна система.
            //Погледнете упътването за предходната задача.Резултат: F59E(16) и
            //62878(10).

           // 1111      0101       1001      1110
           // 15 = F;    5           9        14=E



           //  1111010110011110(2) = F59E(16);

           // 1111010110011110
           //(1*2^15)+(1 * 2 ^14)+(1 * 2 ^13)+(1 * 2 ^12)+ 0 +(1 * 2 ^10)+ 0 +(1 * 2 ^8)+(1 * 2 ^7)+ 0 + 0+(1 * 2 ^4)+(1 * 2 ^3)+(1 * 2 ^2)+(1 * 2 ^1)+ 0=
           // = 32,768+ 16,384 + 8,192 + 4,096 + 1,024 + 256 + 128 + 16 + 8 + 4 + 2 = 62878(10);









        }







    }
}
