using System;

namespace Problem1
{
    class Program
    {
        static void Main()
        {

            // 1.Превърнете числата 151, 35, 43, 251, 1023 и 1024 в двоична
            // бройна система.
//            Използвайте методите за превръщане от една бройна система в
//друга.Можете да сверите резултатите си с калкулатора на Windows,
//който поддържа работа с бройни системи след превключване в режим
//"Programmer".Резултатите са 10010111, 100011, 11111011, 1111111111 и
//10000000000.

            // 151:2 = 75 остатък  1;
            // 75:2 = 37 остатък  1;
            // 37:2= 18 остатък 1;
            // 18:2= 9 остатък 0;
            // 9:2= 4 остатък 1;
            // 4:2=2 остатък 0;
            // 2:2=1 остатък 0;
            // 1:2=0 остатък 1;

            //151(10)=10010111(2)

            // 35:2=17 остатък 1;
            // 17:2= 8 остатък 1;
            // 8:2= 4 остатък 0;
            // 4:2= 2 остатък 0;
            // 2:2= 1 остатък 0;
            // 1:2=0 остатък 1;

            // 32(10)= 100011(2)

            //43:2= 21 остатък 1;
            //21:2=10 остатък 1;
            //10:2=5 остатък 0;
            //5:2=2 остатък 1;
            //2:2=1 остатък 0;
            //1:2=0 остатък 1;

            // 43(10)=101011(2)

            //251:2= 125 остатък 1;
            //125:2= 62 остатък 1;
            //62:2= 31 остатък 0;
            //31:2= 15 остатък 1;
            //15:2= 7 остатък 1;
            //7:2 = 3 остатък 1;
            //3:2= 1 остатък 1;
            //1:2=0 остатък 1;

            //251(10)= 11111011(2)

            //1023:2= 511 остатък 1;
            //511:2= 255 остатък 1;
            //255:2= 127 остатък 1;
            //127:2= 63 остатък 1;
            //63:2= 31 остатък 1;
            //31:2= 15 остатък 1;
            //15:2 = 7 остатък 1;
            //7:2= 3 остатък 1;
            //3:2=1 остатък 1;
            //1:2=0 остатък 1;

            //1023(10)= 1111111111(2)

            //1024:2= 512 остатък 0;
            //512:2= 256 остатък 0;
            //256:2= 128 остатък 0;
            //128:2= 64 остатък 0;
            //64:2= 32 остатък 0;
            //32:2= 16 остатък 0;
            //16:2= 8 остатък 0;
            //8:2= 4 остатък 0;
            //4:2=2 остатък 0;
            //2:2=1 остатък 0;
            //1:2= 0 остатък 1;

            //1024(10)= 10000000000(2)



        }
    }
}
